Repository: lensapp/lens
Catalog: dashboard/locales/*/messages.po
Languages: ru

source: (empty) (Allowing the specific traffic to all pods in this namespace)
ru: (Пусто) (Допускается трафик ко всем подам в данной области имен)

source: <0>Filtered</0>: {itemsCount} / {allItemsCount}
ru: <0>Отфильтровано</0>: {itemsCount} / {allItemsCount}

source: <0>Your browser does not support all Kontena Lens features. </0> Please consider using another browser.
ru: <0>Ваш браузер не поддерживает все возможности Kontena Lens. </0> Пожалуйста рассмотрите использование другого современного браузера.

source: Access Control
ru: Контроль доступа

source: Access Modes
ru: Режимы доступа

source: Account Name
ru: Название аккаунта

source: Active
ru: Активный

source: Add Namespace
ru: Добавить Namespace

source: Add RoleBinding
ru: Добавить привязку ролей

source: Add bindings to {name}
ru: Добавить привязки к {name}

source: Add field
ru: Добавить поле

source: Addresses
ru: Адреса

source: Affinities
ru: Аффинитеты

source: Age
ru: Возраст

source: All logs
ru: Все логи

source: Annotations
ru: Аннотации

source: Api Groups
ru: API группы

source: App Version
ru: Версия приложения

source: App crash at <0>{pageUrl}</0>
ru: Сбой работы приложения на <0>{pageUrl}</0>

source: Applying..
ru: Применение..

source: Apps
ru: Приложения

source: Are you sure you want to drain <0>{nodeName}</0>?
ru: Выполнить команду drain для ноды <0>{nodeName}</0>?

source: Arguments
ru: Аргументы

source: Back
ru: Назад

source: Backends
ru: Бэкенды

source: Binding
ru: Привязка

source: Binding targets
ru: Цели привязки

source: Bindings
ru: Привязки

source: Build version
ru: Версия билда

source: Bytes consumed on this filesystem
ru: Байты, потребляемые в файловой системе

source: Bytes received by all containers
ru: Байты, полученные всеми контейнерами

source: Bytes sent by Ingress controller with error status
ru: Байты, отправленные контроллером доступа (Ingress) со статусом ошибки

source: Bytes sent by Ingress controller with successful status
ru: Байты, отправленные контроллером доступа (Ingress) с успешным статусом

source: Bytes sent, status 2xx
ru: Байты отправлены, статус 2xx

source: Bytes sent, status 5xx
ru: Байты отправлены, статус 5xx

source: Bytes transmitted from all containers
ru: Байты, отправленные всеми контейнерами

source: CPU
ru: Процессор

source: CPU capacity
ru: Мощность процессора

source: CPU cores usage
ru: Использование ядер процессора

source: CPU limits
ru: Лимиты процессора

source: CPU requests
ru: Запросы к процессору

source: Cancel
ru: Отмена

source: Capacity
ru: Емкость

source: Certificates
ru: Сертификаты

source: Chart
ru: Чарт

source: Chart Release <0>{0}</0> successfully created.
ru: Релиз чарта <0>{0}</0> успешно создан.

source: Chart: {0}
ru: Чарт: {0}

source: Charts
ru: Чарты

source: Checking update
ru: Проверка обновлений

source: Claim
ru: Запрос

source: Close
ru: Закрыть

source: Close (Ctrl+W)
ru: Закрыть (Ctrl+W)

source: Cluster
ru: Кластер

source: Cluster IP
ru: IP-адрес кластера

source: Command
ru: Команда

source: Common Name
ru: Общее имя

source: Compact view
ru: Компактный вид

source: Completions
ru: Завершения

source: Component stack
ru: Стэк компонентов

source: Condition
ru: Состояние

source: Conditions
ru: Состояния

source: Config copied to clipboard
ru: Конфигурация скопирована в буфер

source: ConfigMap <0>{0}</0> successfully updated.
ru: ConfigMap <0>{0}</0> успешно обновлена.

source: Configuration
ru: Конфигурация

source: Connection
ru: Соединение

source: Container
ru: Контейнер

source: Container CPU cores usage
ru: Использование ядер процессора

source: Container CPU requests
ru: Запросы CPU от контейнеров

source: Container memory limits
ru: Лимиты памяти

source: Container memory requests
ru: Запросы памяти от контейнеров

source: Container memory usage
ru: Использование памяти

source: Container runtime
ru: Среда контейнеров

source: Containers
ru: Контейнеры

source: Context
ru: Контекст

source: Controlled By
ru: Управляемый

source: Controlled by
ru: Контролируется

source: Copy to clipboard
ru: Копировать

source: Cordon
ru: Блокировка

source: Count
ru: Кол-во

source: Create
ru: Создать

source: Create Namespace
ru: Создать Namespace

source: Create ResourceQuota
ru: Создать ResourceQuota

source: Create Role
ru: Создать роль

source: Create Secret
ru: Создать секрет

source: Create Service Account
ru: Создать Service Account

source: Create new ResourceQuota
ru: Создать новую ResourceQuota

source: Create new Role
ru: Создать новую роль

source: Create new RoleBinding
ru: Создать новый билдинг роли

source: Create new Secret
ru: Создать новый секрет

source: Create new Service Account
ru: Создать новый Service Account

source: Create resource
ru: Создать ресурс

source: Created
ru: Создано

source: Created at
ru: Создано

source: Current / Target
ru: Текущее / Цель

source: Current replica scale: {currentReplicas}
ru: Текущий размер реплики: {currentReplicas}

source: Currently applied filters:
ru: Текущие фильтры:

source: DNS Provider
ru: DNS провайдер

source: DNS names
ru: DNS имена

source: Data
ru: Данные

source: Default
ru: По умолчанию

source: Delete
ru: Удалить

source: Description
ru: Описание

source: Desired number of replicas
ru: Нужный уровень реплик

source: Disk
ru: Диск

source: Disk:
ru: Диск:

source: Domains
ru: Домены

source: Download file
ru: Скачать файл

source: Drain
ru: Очистка

source: Drain Node
ru: Очистить Node

source: Driver
ru: Драйвер

source: Duration
ru: Продолжительность

source: E-mail
ru: Эл. почта

source: Edit
ru: Изменить

source: Edit RoleBinding <0>{roleBindingName}</0>
ru: Редактировать RoleBinding <0>{roleBindingName}</0>

source: Effect
ru: Эффект

source: Enter a name
ru: Название

source: Environment
ru: Среда

source: Error stack
ru: Стэк ошибки

source: Events
ru: События

source: Everything is fine in the Cluster
ru: В кластере все в порядке

source: Excluded items with "system:" prefix
ru: За исключением объектов с префиксом “system:”

source: Exit full size mode
ru: Выйти из полного размера

source: Extended view
ru: Расширенный вид

source: External IP
ru: Внешний IP

source: External IPs
ru: Внешние IP

source: Failed to load logs: {0}
ru: Ошибка загрузки логов: {0}

source: Filesystem
ru: Файловая система

source: Filters ({0}/{1})
ru: Фильтры ({0}/{1})

source: Finalizers
ru: Финализаторы

source: First seen
ru: Увиденно впервые

source: Fit to window
ru: По размеру окна

source: From
ru: От

source: From <0>{from}</0> to <1>{to}</1>
ru: От <0>{from}</0> до <1>{to}</1>

source: Group
ru: Группа

source: Groups
ru: Группы

source: Helm Chart Install
ru: Установка Helm чарта

source: Helm Install: {repo}/{name}
ru: Helm установка: {repo}/{name}

source: Helm Upgrade: {0}
ru: Helm обновление: {0}

source: Hide
ru: Скрыть

source: High number of replicas may cause cluster performance issues
ru: Большое количество реплик может вызвать проблемы с производительностью кластера

source: Home
ru: Ссылка

source: Host: {0}
ru: Хост: {0}

source: IP addresses
ru: IP-адреса

source: Image
ru: Изображение

source: Images
ru: Изображения

source: Init Containers
ru: Контейнеры инициализации

source: Install
ru: Установить

source: Installation complete!
ru: Установка завершена!

source: Installing...
ru: Установка..

source: Invalid account ID
ru: Неверный ID аккаунта

source: Invalid number
ru: Неверный номер

source: Involved Object
ru: Затронутый объект

source: Involved object
ru: Затронутый объект

source: Item list is empty
ru: Список пуст

source: Kernel version
ru: Версия Kernel

source: Key
ru: Ключ

source: Key Algorithm
ru: Алгоритм ключа

source: Key Size
ru: Размер ключа

source: Keys
ru: Ключи

source: Keywords
ru: Ключевые слова

source: Kind
ru: Тип

source: Kubeconfig
ru: Файл конфигурации

source: Kubeconfig File
ru: Файл конфигурации

source: Kubelet version
ru: Версия Kubelet

source: Labels
ru: Метки

source: Last Failure Time
ru: Время последнего сбоя

source: Last schedule
ru: Последний запуск

source: Last seen
ru: Увиденно в последний раз

source: Last transition time: {lastTransitionTime}
ru: Последнее изменение: {lastTransitionTime}

source: Limits
ru: Лимиты

source: Lines
ru: Строки

source: Liveness
ru: Живучесть

source: Load Balancer IP
ru: IP балансировщика нагрузки

source: Loading
ru: Загрузка

source: Logs
ru: Логи

source: Logs copied to clipboard.
ru: Скопировано.

source: Maintainers
ru: Создатели

source: Master
ru: Мастера

source: Match Expressions
ru: Совпадения выражений

source: Match Labels
ru: Совпадения меток

source: Max Pods
ru: Макс. подов

source: Maximum length is {maxLength}
ru: Максимальная длина {maxLength}

source: Memory
ru: Память

source: Memory capacity
ru: Объем памяти

source: Memory limits
ru: Лимиты памяти

source: Memory requests
ru: Запросы к памяти

source: Memory usage
ru: Использование памяти

source: Memory:
ru: Память:

source: Message
ru: Сообщение

source: Metrics
ru: Метрики

source: Metrics not available at the moment
ru: В данный момент метрики недоступны

source: Min Pods
ru: Мин. подов

source: Minimize
ru: Минимизировать

source: Minimum length is {minLength}
ru: Минимальная длина {minLength}

source: Mount Options
ru: Опции монтирования

source: Mountable secrets
ru: Монтируемые секреты

source: Mounts
ru: Установки

source: Name
ru: Имя

source: Name (optional)
ru: Название (необязательно)

source: Network
ru: Сеть

source: Network File System
ru: Сетевая файловая система

source: New logs since opening the dialog
ru: Новые логи с момента открытия диалога

source: New tab
ru: Новая вкладка

source: New version available:
ru: Доступна новая версия:

source: New version: {lastVersion}
ru: Новая версия: {lastVersion}

source: Next
ru: Далее

source: No
ru: Нет

source: No Nodes Available.
ru: Нет доступных нод.

source: No filters available.
ru: Нет доступных фильтров.

source: No issues found
ru: Проблемы не обнаружены

source: No items found.
ru: Ничего не найдено.

source: No revisions to rollback.
ru: Нет изменений для отката.

source: Node
ru: Нода

source: Node Pods capacity
ru: Емкость подов

source: Node Selector
ru: Селектор ноды

source: Node filesystem size in bytes
ru: Размер файловой системы ноды в байтах

source: Node filesystem usage in bytes
ru: Использование файловой системы ноды в байтах

source: Node shell
ru: Командная строка ноды

source: Nodes
ru: Ноды

source: Not After
ru: Не позже

source: Note: StatefulSet Volumes won't be deleted automatically
ru: Внимание: StatefulSet Volumes не будут удалены автоматически

source: Notes
ru: Заметки

source: Number of running Pods
ru: Кол-во работающих подов

source: OS
ru: ОС

source: OS Image
ru: Образ ОС

source: Object
ru: Объект

source: Ok
ru: Ок

source: Open
ru: Открыть

source: Operator
ru: Оператор

source: Organization
ru: Организация

source: Overview
ru: Обзор

source: Page not found
ru: Страница не найдена

source: Parallelism
ru: Параллелизм

source: Parameters
ru: Параметры

source: Path
ru: Путь

source: Pod IP
ru: IP пода

source: Pod Selector
ru: Селектор подов

source: Pod Status
ru: Статус подов

source: Pod shell
ru: Командная строка пода

source: Policy Types
ru: Типы политик

source: Ports
ru: Порты

source: Priority Class
ru: Класс приоритета

source: Private Key Secret
ru: Секрет приватного ключа

source: Provisioner
ru: Комиссия

source: QoS Class
ru: QoS класс

source: Quotas
ru: Квоты

source: Readiness
ru: Готовность

source: Reason
ru: Причина

source: Reason: {0} ({1})
ru: Причина: {0} ({1})

source: Receive
ru: Получение

source: Reclaim Policy
ru: Политика отката

source: Reference
ru: Ссылка

source: Release
ru: Релиз

source: Release <0>{releaseName}</0> successfully upgraded to version <1>{version}</1>
ru: Релиз <0>{releaseName}</0> успешно обновлен до версии <1>{version}</1>

source: Release name
ru: Название релиза

source: Release: {0}
ru: Установка: {0}

source: Releases
ru: Релизы

source: Remove
ru: Удалить

source: Remove <0>{releaseNames}</0>?
ru: Удалить <0>{releaseNames}</0>?

source: Remove field
ru: Удалить поле

source: Remove item?
ru: Удалить объект?

source: Remove selected bindings for <0>{0}</0>?
ru: Удалить выбранные связки <0>{0}</0>?

source: Remove selected bindings from ${name}
ru: Удалить выбранные связки из ${name}

source: Remove selected items ({0})
ru: Удалить выбранные элементы ({0})

source: Remove {resourceKind} <0>{resourceName}</0>?
ru: Удалить {resourceKind} <0>{resourceName}</0>?

source: Renew Before
ru: Обновить до

source: Replicas
ru: Реплики

source: Repo/Name
ru: Репозиторий/Имя

source: Repository
ru: Репозиторий

source: Request
ru: Запрос

source: Request duration in seconds
ru: Продолжительность запроса в секундах

source: Requests
ru: Запросы

source: Required field
ru: Обязательное поле

source: Reset
ru: Сбросить

source: Reset filters?
ru: Сбросить фильтры?

source: Resource Names
ru: Имена ресурсов

source: Resource Quotas
ru: Квоты ресурсов

source: Resource loading has failed: <0>{0}</0>
ru: Загрузка ресурса не удалась: <0>{0}</0>

source: Resource {0} on Pods {addition}
ru: Ресурс {0} на подах {addition}

source: ResourceQuota name
ru: Имя квоты ресурса

source: Resources
ru: Ресурсы

source: Response
ru: Ответ

source: Response duration in seconds
ru: Продолжительность ответа в секундах

source: Restart session
ru: Перезагрузить сессию

source: Restarts
ru: Перезагрузки

source: Revision
ru: Ревизия

source: Role ID
ru: Идентификатор роли

source: Role name
ru: Имя роли

source: Rollback
ru: Откат

source: Rollback <0>{releaseName}</0>
ru: Откатить <0>{releaseName}</0>

source: Rules
ru: Правила

source: Save
ru: Сохранить

source: Scale
ru: Масштабировать

source: Scale Deployment <0>{deploymentName}</0>
ru: Масштабировать Deployment <0>{deploymentName}</0>

source: Schedule
ru: Расписание

source: Scope Selector
ru: Селектор области

source: Scope name
ru: Имя области

source: Search Helm Charts
ru: Искать Helm чарты

source: Search...
ru: Поиск..

source: Secret
ru: Секрет

source: Secret Name
ru: Название секрета

source: Secret name
ru: Имя секрета

source: Secret successfully updated.
ru: Секрет успешно обновлен.

source: Secret type
ru: Тип секрета

source: Select a quota..
ru: Выберите квоту...

source: Select role..
ru: Выбрать роль..

source: Select service accounts
ru: Выбрать сервисные аккаунты

source: Selector
ru: Селектор

source: Server
ru: Сервер

source: Session Affinity
ru: Направление сессии

source: Set
ru: Установлено

source: Set quota
ru: Установить квоту

source: Shell
ru: Командная строка

source: Shell: {nodeName}
ru: Командная строка: {nodeName}

source: Show
ru: Показать

source: Show Notes
ru: Показать логи

source: Show value
ru: Показать значение

source: Size
ru: Размер

source: Source
ru: Источник

source: Specified limits are higher than node capacity!
ru: Заданные лимиты выше вместимости ноды!

source: Status
ru: Статус

source: Status URI
ru: Адрес статуса

source: Storage Class Name
ru: Имя Storage Class

source: Storage class
ru: Класс хранилища

source: Strategy Type
ru: Тип стратегии

source: Sub-object
ru: Суб-объект

source: Submit
ru: Отправить

source: Submitting..
ru: Применение..

source: Suspend
ru: Заморозка

source: Taints
ru: Метки блокировки

source: Terminal
ru: Терминал

source: Terminal session
ru: Сессия терминала

source: There are no logs available for container.
ru: Для контейнера нет логов.

source: There are no logs available.
ru: Логи отсутствуют.

source: This field is required
ru: Это обязательное поле

source: This field must contain only lowercase latin characters, numbers and dash.
ru: Это поле может содержать только латинские буквы в нижнем регистре, номера и дефис.

source: To
ru: Из

source: To help us improve the product please report bugs to {slackLink} community or {githubLink} issues tracker.
ru: Чтобы помочь нам улучшить продукт пожалуйста отправляйте ошибки на {slackLink} сообщество или {githubLink} трекер ошибок.

source: Tokens
ru: Токены

source: Tolerations
ru: Толерантности

source: Transit
ru: Транзит

source: Type
ru: Тип

source: URL
ru: УРЛ

source: Uncordon
ru: Разблокировка

source: Update
ru: Обновить

source: Updated
ru: Обновлено

source: Updating..
ru: Обновление..

source: Upgrade
ru: Обновить

source: Upgrade version
ru: Обновить версию

source: Usage
ru: Использование

source: Use same name for RoleBinding
ru: Использовать тоже имя для привязки ролей

source: Used
ru: Использовано

source: User
ru: Пользователь

source: Value
ru: Значение

source: Values
ru: Конфигурация

source: Verbs
ru: Определения

source: Version
ru: Версия

source: View Helm Release
ru: Показать Helm релиз

source: Volume Binding Mode
ru: Режим связи с Volume

source: Volume disk capacity
ru: Емкость диска Volume

source: Volume disk usage
ru: Использование диска Volume

source: Waiting services to be running
ru: Ожидание запуска сервисов

source: Warnings: {0}
ru: Предупреждения: {0}

source: Worker
ru: Рабочие

source: Workloads
ru: Ресурсы

source: Wrong email format
ru: Неверный формат электронной почты

source: Wrong url format
ru: Неверный url формат

source: Yes
ru: Да

source: Zone
ru: Зона

source: ago
ru: тому назад

source: and <0>{tailCount}</0> more
ru: и <0>{tailCount}</0> ещё

source: cores:
ru: ядер:

source: exit code
ru: код выхода

source: ready
ru: готово

source: sec
ru: сек

source: timestamps
ru: временные метки

source: {0, plural, one {Resource} other {Resources}}
ru: {0, plural, one {Ресурс} few {Ресурсы} many {Ресурсы} other {Ресурсы}}

source: {0} desired, {1} updated
ru: {0} ожидаемые, {1} обновленные

source: {0} on <0>{kind}/{name}</0>
ru: {0} на <0>{kind}/{name}</0>

source: {0} on Pods
ru: {0} на Подах

source: {0} on {1}
ru: {0} на {1}

source: {0} total, {1} available
ru: {0} всего, {1} доступно

source: {0} unavailable
ru: {0} недоступно

source: {accountName} kubeconfig
ru: {accountName} конфигурация

source: {allItemsCount, plural, one {# item} other {# items}}
ru: {allItemsCount, plural, one {# элемент} few {# элемента} many {# элементов} other {# элементов}}

source: {metricsRemainCount} more...
ru: {metricsRemainCount} еще…

source: {podName} Logs
ru: {podName} логи

source: {resourceType} <0>{resourceName}</0> updated.
ru: {resourceType} <0>{resourceName}</0> обновлен.

source: {selectedCount, plural, one {<0>Remove item <1>{selectedNames}</1>?</0>} other {<2>Remove <3>{selectedCount}</3> items <4>{selectedNames}</4> {tail}?</2>}}
ru: { selectedCount, plural, one {<0>Удалить элемент <1>{selectedNames}</1>?</0>} few {<2>Удалить <3>{selectedCount}</3> элемента <4>{selectedNames}</4> {tail}?</2>} many {<2>Удалить <3>{selectedCount}</3> элементов <4>{selectedNames}</4> {tail}?</2>} other {<2>Удалить <3>{selectedCount}</3> элементов <4>{selectedNames}</4> {tail}?</2>} }

source: {submitLabel} & Close
ru: {submitLabel} и закрыть
